Repository: City-of-Helsinki/hauki
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Period name
fi: Jakson nimi

source: Resource
fi: Resurssi

source: Start date
fi: Alkupäivämäärä

source: End date
fi: Loppupäivämäärä

source: Resource state
fi: Resurssin tila

source: Data source name
fi: Lähdejärjestelmän nimi

# State
source: Open
fi: Auki

# State
source: Closed
fi: Suljettu

# State
source: Undefined
fi: Ei aukioloa

# State
source: Self service
fi: Itsepalvelu

# State
source: With key
fi: Avaimella

# State
source: With reservation
fi: Varauksella

# State
source: Open and reservable
fi: Auki ja varattavissa

# State
source: With key and reservation
fi: Avaimella ja varauksella

# State
source: Enter only
fi: Vain sisäänkäynti

# State
source: Exit only
fi: Vain uloskäynti

# State
source: Weather permitting
fi: Sään salliessa

# State
source: Not in use
fi: Ei vuoroa käytössä

# State
source: Maintenance
fi: Siivoustauko/huoltotauko

# State
source: Reserved
fi: Varattu

# State
source: By appointment
fi: Ajanvarauksella

# Weekday
source: Monday
fi: Maanantai

# Weekday
source: Tuesday
fi: Tiistai

# Weekday
source: Wednesday
fi: Keskiviikko

# Weekday
source: Thursday
fi: Torstai

# Weekday
source: Friday
fi: Perjantai

# Weekday
source: Saturday
fi: Lauantai

# Weekday
source: Sunday
fi: Sunnuntai

# RuleContext
source: Period
fi: Jakso

# RuleContext
source: Year
fi: Vuosi

# RuleContext
source: Month
fi: Kuukausi

# every_rulecontext
source: period
fi: Jakson

# every_rulecontext
source: year
fi: vuoden

# every_rulecontext
source: month
fi: kuukauden

# RuleSubject
source: Day
fi: Päivä

# RuleSubject
source: Week
fi: Viikko

# RuleSubject
source: Month
fi: Kuukausi

# RuleSubject
source: Monday
fi: Maanantai

# RuleSubject
source: Tuesday
fi: Tiistai

# RuleSubject
source: Wednesday
fi: Keskiviikko

# RuleSubject
source: Thursday
fi: Torstai

# RuleSubject
source: Friday
fi: Perjantai

# RuleSubject
source: Saturday
fi: Lauantai

# RuleSubject
source: Sunday
fi: Sunnuntai

# starting_from_nth_rulesubject
source: day
fi: päivästä

# starting_from_nth_rulesubject
source: week
fi: viikosta

# starting_from_nth_rulesubject
source: month
fi: kuukaudesta

# starting_from_nth_rulesubject
source: mon
fi: maanantaista

# starting_from_nth_rulesubject
source: tue
fi: tiistaista

# starting_from_nth_rulesubject
source: wed
fi: keskiviikosta

# starting_from_nth_rulesubject
source: thu
fi: torstaista

# starting_from_nth_rulesubject
source: fri
fi: perjantaista

# starting_from_nth_rulesubject
source: sat
fi: lauantaista

# starting_from_nth_rulesubject
source: sun
fi: sunnuntaista

# FrequencyModifier
source: Even
fi: Parillinen

# FrequencyModifier
source: Odd
fi: Pariton

source: Name
fi: Nimi

source: Description
fi: Kuvaus

source: Data source
fi: Lähdejärjestelmä

source: Data sources
fi: Lähdejärjestelmät

source: Street address
fi: Katuosoite

source: Resource type
fi: Resurssin tyyppi

source: Sub resources
fi: Aliresurssit

source: Extra data
fi: Lisätiedot

source: Resources
fi: Resurssit

source: Origin ID
fi: Tunniste lähdejärjestelmässä

source: Resource origin
fi: Resurssin lähde

source: Resource origins
fi: Resurssin lähteet

source: Override
fi: Yliajo

source: Period
fi: Jakso

source: Periods
fi: Jaksot

source: Not specified
fi: Ei määritelty

source: {name}{description}Date period: {dates} Opening hours: {time_span_groups}
fi: {name}{description}Aikajakso: {dates} Aukioloajat: {time_span_groups}

source: Period origin
fi: Jakson lähde

source: Period origins
fi: Jakson lähteet

source: In effect when every one of these match:
fi: Voimassa kun kaikki seuraavat pätevät:

source: Start time
fi: Alkuaika

source: End time
fi: Loppuaika

source: 24 hours
fi: 24 tuntia

source: Weekday
fi: Viikonpäivä

source: Time span
fi: Aikaväli

source: Time spans
fi: Aikavälit

# timespan_as_text
source: Every day
fi: Joka päivä

# timespan_as_text
source: The whole day
fi: Koko päivän

source: Context
fi: Konteksti

source: Subject
fi: Kohde

source: Start
fi: Alku

source: Frequency (ordinal)
fi: Toistuvuus (järjestysnumero)

source: Frequency (modifier)
fi: Toistuvuus (määre)

source: Rule
fi: Sääntö

source: Rules
fi: Säännöt

# rule_as_text_context
source: the period
fi: Jakson

# rule_as_text_context
source: every {context}
fi: Jokaisen {context}

# rule_as_text
source: {nth} {subject} in {context}
fi: {context} {nth} {subject}

# rule_as_text
source: starting from the {nth} {last} {subject}
fi: alkaen {nth} {last} {subject}

# starting_from_the_last
source: last
fi: viimeisestä

# rule_as_text
source: Every {nth} {subject} in {context} {starting_from_text}
fi: {context} joka {nth} {subject} {starting_from_text}

# rule_as_text
source: On {modifier} {subject}s in {context}
fi: {context} jokainen {modifier} {subject}

source: Signature
fi: Allekirjoitus

source: Signature created at
fi: Allekirjoituksen luontiaika

source: Signature valid until
fi: Allekirjoituksen vanhenemisaika

source: Invalidated time
fi: Mitätöintiaika

source: Signing key
fi: Allekirjoitusavain

source: Key valid after
fi: Avaimen voimassaoloaika alkaa

source: Key valid until
fi: Avaimen voimassaoloaika loppuu

source: Invalid start_date
fi: Viallinen alkupäivämäärä

source: Invalid end_date
fi: Viallinen loppupäivämäärä

source: User origin
fi: Käyttäjän lähde

source: User origins
fi: Käyttäjän lähteet
